package main

/*
编写一个函数，输入是一个无符号整数（以二进制串的形式），返回其二进制表达式中
设置位
 的个数（也被称为汉明重量）。
*/

func hammingWeight(n int) int {
	ans := 0
	for ; n > 0; n &= n - 1 {
		ans++
	}
	return ans
}

// const (
// 	m1  = 0x55555555 // 01010101010101010101010101010101
// 	m2  = 0x33333333 // 00110011001100110011001100110011
// 	m4  = 0x0f0f0f0f // 00001111000011110000111100001111
// 	m8  = 0x00ff00ff // 00000000111111110000000011111111
// 	m16 = 0x0000ffff // 00000000000000001111111111111111
// )

// func hammingWeight(n int) int {
// 	n = n&m1 + n>>1&m1
// 	n = n&m2 + n>>2&m2
// 	n = n&m4 + n>>4&m4
// 	n = n&m8 + n>>8&m8
// 	n = n&m16 + n>>16&m16
// 	return n
// }
